// 2. **Задание: Анализ оценок студентов**
    
//     Вам необходимо написать программу, которая проведёт анализ оценок студентов и выполнит несколько операций с использованием методов массивов.
    
//     Шаги выполнения:
    
//     1. Создайте пустой массив с именем `grades` и заполните массив случайными оценками от 1 до 100 для 12 студентов. Для генерации случайных оценок, используйте функцию `Math.random()`.

//создание пустого массива:
const grades = [];

//функция генерации случайной оценки от 1 до 100:
let getRandomGrade = (min, max) => { 
    min = Math.ceil(min);
    max = Math.floor(max);
    return Math.floor(Math.random() * (max - min + 1)) + min; //Максимум и минимум включаются
  }  
console.log (`случайная оценка: ${getRandomGrade(1, 100)}`);

//создание массива генерации случайных оценок
const generateArray = (length) => (
    [...new Array(length)].map(() => getRandomGrade(1, 100))
  );

//заполнение первого пустого массива grades массивом генерации оценок generateArray
generateArray(12).forEach(element => grades.push(element));
console.log (grades);
document.writeln(`Оценки студентов: ${grades.join(', ')}.`);


//     2. Рассчитайте и выведите средний балл студентов, используя методы массивов.

const getAverageGrades = (grades) => {
    const sumGrades = grades.reduce((accumulator, currentValue) => accumulator + currentValue);
    const length = grades.length;
    return sumGrades / length; //делю сумму всех оценок на количество студентов
}
console.log(getAverageGrades(grades));
document.writeln(`</br> Средний балл студентов: ${getAverageGrades(grades)}.`);

//     3. Найдите и выведите максимальный балл среди студентов, используя соответствующий метод массива.

const maxGrade = Math.max(...grades);
console.log(maxGrade);
document.writeln(`</br> Максимальный балл студентов: ${maxGrade}.`);

//     4. Найдите и выведите минимальный балл среди студентов, используя соответствующий метод массива.

const minGrade = Math.min(...grades);
console.log(minGrade);
document.writeln(`</br> Максимальный балл студентов: ${minGrade}.`);

//     5. Посчитайте и выведите количество студентов, получивших положительную оценку (балл выше или равен 60). Используйте метод массива, который фильтрует оценки и оставляет только те, которые соответствуют заданному условию. Затем посчитайте количество оставшихся оценок и выведите результат.



//     6. Посчитайте и выведите количество студентов, получивших отрицательную оценку (балл ниже 60). Используйте аналогичный подход, как в предыдущем шаге.
//     7. Преобразуйте числовые оценки в формат буквенных оценок A/B/C/D/E, используя следующие правила:
//         - Если оценка находится в диапазоне от 80 до 100, преобразуйте её в "A"
//         - Если оценка находится в диапазоне от 60 до 79, преобразуйте её в "B"
//         - Если оценка находится в диапазоне от 40 до 59, преобразуйте её в "C"
//         - Если оценка находится в диапазоне от 20 до 39, преобразуйте её в "D"
//         - Если оценка ниже 20, преобразуйте её в "E"
    
//     Выведите все найденные значения на экран.